# Задача 14
# Требуется вывести все целые степени двойки (т.е. числа вида 2k), не превосходящие числа N.

print("Программа выводит все целые степени двойки!")

N = int(input("Введите число : "))
